(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "Изберете дата ...",
		        "buttonLabel": "Щракнете или натиснете бутона за въвеждане или интервала, за да отворите календара",
		        "prevButtonLabel": "Отиди на предишния месец",
		        "nextButtonLabel": "Отидете на следващия месец",
		        "closeButtonTitle": "Близо",
		        "closeButtonLabel": "Затворете календара",
		        "prevMonthButtonLabel": "Отидете на предходната година",
		        "prevYearButtonLabel": "Отидете на предишните двайсет години",
		        "nextMonthButtonLabel": "Отидете на следващата година",
		        "nextYearButtonLabel": "Отидете на следващите двадесет години",
		        "changeMonthButtonLabel": "Щракнете или натиснете бутона за въвеждане или интервала, за да се промени на месеца",
		        "changeYearButtonLabel": "Щракнете или натиснете бутона за въвеждане или интервала, за да се промени годината",
		        "changeRangeButtonLabel": "Щракнете или натиснете бутона за въвеждане или интервала, за да преминете към следващите двадесет години",
		        "calendarHelp": "- Up Arrow и стрелка надолу - отива в един и същи ден от седмицата през предходната или следващата седмица, съответно. Ако не се стигне до края на месеца, продължава в следващия или предходния месец, както е подходящо.\r\n- Left Arrow и дясна стрелка - аванси един ден до следващия, и в един непрекъснат процес. Визуално фокус се измества от ден на ден и се увива от ред на ред в мрежата на ден.\r\n- Control + Page Up - Преминава към същата дата през предходната година.\r\n- Control + Page Down - Преминава към същата дата през следващата година.\r\n- Начало - Преминава към първия ден на текущия месец.\r\n- Край - Преминава към последния ден на текущия месец.\r\n- Page Up - Преминава към същата дата през предходния месец.\r\n- Page Down - Преминава към същата дата през следващия месец.\r\n- Въвеждане или Espace - затваря календара, а избраната дата е показан на свързаната текстовото поле.\r\n- Escape - затваря календара без никакво действие."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "януари",
		        "февруари",
		        "март",
		        "април",
		        "май",
		        "юни",
		        "юли",
		        "август",
		        "септември",
		        "октомври",
		        "ноември",
		        "декември"
		    ],
		    "month_names_abbreviated": [
		        "ян.",
		        "февр.",
		        "март",
		        "апр.",
		        "май",
		        "юни",
		        "юли",
		        "авг.",
		        "септ.",
		        "окт.",
		        "ноем.",
		        "дек."
		    ],
		    "month_names_narrow": [
		        "я",
		        "ф",
		        "м",
		        "а",
		        "м",
		        "ю",
		        "ю",
		        "а",
		        "с",
		        "о",
		        "н",
		        "д"
		    ],
		    "day_names": [
		        "неделя",
		        "понеделник",
		        "вторник",
		        "сряда",
		        "четвъртък",
		        "петък",
		        "събота"
		    ],
		    "day_names_abbreviated": [
		        "нд",
		        "пн",
		        "вт",
		        "ср",
		        "чт",
		        "пт",
		        "сб"
		    ],
		    "day_names_short": [
		        "нд",
		        "пн",
		        "вт",
		        "ср",
		        "чт",
		        "пт",
		        "сб"
		    ],
		    "day_names_narrow": [
		        "н",
		        "п",
		        "в",
		        "с",
		        "ч",
		        "п",
		        "с"
		    ],
		    "day_periods": {
		        "am": "пр.об.",
		        "noon": "пладне",
		        "pm": "сл.об."
		    },
		    "day_periods_abbreviated": {
		        "am": "пр.об.",
		        "noon": "пладне",
		        "pm": "сл.об."
		    },
		    "day_periods_narrow": {
		        "am": "пр.об.",
		        "noon": "пл.",
		        "pm": "сл.об."
		    },
		    "quarter_names": [
		        "1. тримесечие",
		        "2. тримесечие",
		        "3. тримесечие",
		        "4. тримесечие"
		    ],
		    "quarter_names_abbreviated": [
		        "1. трим.",
		        "2. трим.",
		        "3. трим.",
		        "4. трим."
		    ],
		    "quarter_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4"
		    ],
		    "era_names": [
		        "преди Христа",
		        "след Христа"
		    ],
		    "era_names_abbreviated": [
		        "пр.Хр.",
		        "сл.Хр."
		    ],
		    "era_names_narrow": [
		        "пр.Хр.",
		        "сл.н.е."
		    ],
		    "full_format": "EEEE, d MMMM y 'г'.",
		    "long_format": "d MMMM y 'г'.",
		    "medium_format": "d.MM.y 'г'.",
		    "short_format": "d.MM.yy 'г'.",
		    "firstday_of_week": 1
		};
	}
})();