(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "Επιλέξτε ημερομηνία ...",
		        "buttonLabel": "Κάντε κλικ ή πατήστε το πλήκτρο Enter ή το πλήκτρο διαστήματος για να ανοίξετε το ημερολόγιο",
		        "prevButtonLabel": "Μετάβαση στο προηγούμενο μήνα",
		        "nextButtonLabel": "Μετάβαση στο επόμενο μήνα",
		        "closeButtonTitle": "Κοντά",
		        "closeButtonLabel": "Κλείστε το ημερολόγιο",
		        "prevMonthButtonLabel": "Πηγαίνετε με το προηγούμενο έτος",
		        "prevYearButtonLabel": "Πηγαίνετε με τα προηγούμενα είκοσι χρόνια",
		        "nextMonthButtonLabel": "Μετάβαση στο επόμενο έτος",
		        "nextYearButtonLabel": "Πηγαίνετε στα επόμενα είκοσι χρόνια",
		        "changeMonthButtonLabel": "Κάντε κλικ ή πατήστε το πλήκτρο Enter ή το πλήκτρο διαστήματος για να αλλάξετε το μήνα",
		        "changeYearButtonLabel": "Κάντε κλικ ή πατήστε το πλήκτρο Enter ή το πλήκτρο διαστήματος για να αλλάξετε το έτος",
		        "changeRangeButtonLabel": "Κάντε κλικ ή πατήστε το πλήκτρο Enter ή το πλήκτρο διαστήματος για να πάει στα επόμενα είκοσι χρόνια",
		        "calendarHelp": "- Επάνω και κάτω βέλος - πηγαίνει στην ίδια ημέρα της εβδομάδας κατά την προηγούμενη ή την επόμενη εβδομάδα, αντίστοιχα. Αν φτάσει στο τέλος του μήνα, συνεχίζει στο επόμενο ή προηγούμενο μήνα ανάλογα με την περίπτωση.\r\n- Αριστερό βέλος ή δεξί βέλος - προχωρά μια μέρα στην άλλη, και σε ένα συνεχές. Οπτικά εστίαση μετακινείται από μέρα σε μέρα και αναδιπλώνεται από σειρά σε σειρά το πλέγμα των ημερών.\r\n- Control + Page Up - κινήσεις προς την ίδια ημερομηνία του προηγούμενου έτους.\r\n- Control + Page Down - κινήσεις προς την ίδια ημερομηνία, το επόμενο έτος.\r\n- Σπίτι - κινήσεις προς την πρώτη ημέρα του τρέχοντος μήνα.\r\n- Τέλος - Κινήσεις προς την τελευταία ημέρα του τρέχοντος μήνα.\r\n- Page Up - κινήσεις προς την ίδια ημερομηνία του προηγούμενου μήνα.\r\n- Page Down - κινήσεις προς την ίδια ημερομηνία, τον επόμενο μήνα.\r\n- Εισάγετε ή Espace - κλείνει το ημερολόγιο, και η επιλεγμένη ημερομηνία εμφανίζεται στο σχετικό πλαίσιο κειμένου.\r\n- Escape - κλείνει το ημερολόγιο χωρίς καμία ενέργεια."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "Ιανουαρίου",
		        "Φεβρουαρίου",
		        "Μαρτίου",
		        "Απριλίου",
		        "Μαΐου",
		        "Ιουνίου",
		        "Ιουλίου",
		        "Αυγούστου",
		        "Σεπτεμβρίου",
		        "Οκτωβρίου",
		        "Νοεμβρίου",
		        "Δεκεμβρίου"
		    ],
		    "month_names_abbreviated": [
		        "Ιαν",
		        "Φεβ",
		        "Μαρ",
		        "Απρ",
		        "Μαΐ",
		        "Ιουν",
		        "Ιουλ",
		        "Αυγ",
		        "Σεπ",
		        "Οκτ",
		        "Νοε",
		        "Δεκ"
		    ],
		    "month_names_narrow": [
		        "Ι",
		        "Φ",
		        "Μ",
		        "Α",
		        "Μ",
		        "Ι",
		        "Ι",
		        "Α",
		        "Σ",
		        "Ο",
		        "Ν",
		        "Δ"
		    ],
		    "day_names": [
		        "Κυριακή",
		        "Δευτέρα",
		        "Τρίτη",
		        "Τετάρτη",
		        "Πέμπτη",
		        "Παρασκευή",
		        "Σάββατο"
		    ],
		    "day_names_abbreviated": [
		        "Κυρ",
		        "Δευ",
		        "Τρί",
		        "Τετ",
		        "Πέμ",
		        "Παρ",
		        "Σάβ"
		    ],
		    "day_names_short": [
		        "Κυ",
		        "Δε",
		        "Τρ",
		        "Τε",
		        "Πέ",
		        "Πα",
		        "Σά"
		    ],
		    "day_names_narrow": [
		        "Κ",
		        "Δ",
		        "Τ",
		        "Τ",
		        "Π",
		        "Π",
		        "Σ"
		    ],
		    "day_periods": {
		        "am": "π.μ.",
		        "noon": "μεσημέρι",
		        "pm": "μ.μ."
		    },
		    "day_periods_abbreviated": {
		        "am": "π.μ.",
		        "noon": "μεσημέρι",
		        "pm": "μ.μ."
		    },
		    "day_periods_narrow": {
		        "am": "π",
		        "noon": "μεσ.",
		        "pm": "μ"
		    },
		    "quarter_names": [
		        "1ο τρίμηνο",
		        "2ο τρίμηνο",
		        "3ο τρίμηνο",
		        "4ο τρίμηνο"
		    ],
		    "quarter_names_abbreviated": [
		        "Τ1",
		        "Τ2",
		        "Τ3",
		        "Τ4"
		    ],
		    "quarter_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4"
		    ],
		    "era_names": [
		        "προ Χριστού",
		        "μετά Χριστόν"
		    ],
		    "era_names_abbreviated": [
		        "π.Χ.",
		        "μ.Χ."
		    ],
		    "era_names_narrow": [
		        "π.Χ.",
		        "μ.Χ."
		    ],
		    "full_format": "EEEE, d MMMM y",
		    "long_format": "d MMMM y",
		    "medium_format": "d MMM y",
		    "short_format": "d/M/yy",
		    "firstday_of_week": 0
		};
	}
})();