(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "انتخاب تاریخ ...",
		        "buttonLabel": "کلیک کنید فشار دهید و یا کلید را وارد کنید و یا فاصله برای باز کردن تقویم",
		        "prevButtonLabel": "برو به ماه قبل",
		        "nextButtonLabel": "برو به ماه آینده",
		        "closeButtonTitle": "نزدیک",
		        "closeButtonLabel": "بستن تقویم",
		        "prevMonthButtonLabel": "برو به سال گذشته",
		        "prevYearButtonLabel": "برو به بیست سال گذشته",
		        "nextMonthButtonLabel": "برو به سال آینده",
		        "nextYearButtonLabel": "برو به بیست سال آینده",
		        "changeMonthButtonLabel": "کلیک کنید فشار دهید و یا کلید را وارد کنید و یا فاصله برای تغییر ماه",
		        "changeYearButtonLabel": "کلیک کنید فشار دهید و یا کلید را وارد کنید و یا فاصله برای تغییر سال",
		        "changeRangeButtonLabel": "کلیک کنید فشار دهید و یا کلید را وارد کنید و یا فاصله برای رفتن به بیست سال آینده",
		        "calendarHelp": "- پیکان و پایین فلش - می رود به همان روز از هفته در هفته قبلی یا بعدی است. اگر پایان ماه رسیده است، به ماه بعدی یا قبلی به عنوان مناسب همچنان ادامه دارد.\r\n- پیکان چپ و راست - پیشرفت یک روز به بعد، همچنین در یک زنجیره. تمرکز بصری است روز به روز رفت و کاری ادامه داده اند از ردیف به ردیف در شبکه از روز است.\r\n- کنترل + صفحه تا - حرکت به تاریخ مشابه در سال گذشته است.\r\n- کنترل + پایین صفحه - حرکت به همان تاریخ در سال آینده.\r\n- صفحه اصلی - حرکت به اولین روز از ماه جاری است.\r\n- پایان - حرکت به آخرین روز از ماه جاری است.\r\n- صفحه تا - حرکت به همان تاریخ در ماه گذشته.\r\n- پایین صفحه - حرکت به همان تاریخ در ماه آینده.\r\n- وارد کنید و یا اسپاس - بسته تقویم و تاریخ انتخاب شده است در جعبه متن را همراه نشان داده شده است.\r\n- فرار - بسته تقویم بدون هر گونه اقدام."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "جنوری",
		        "فبروری",
		        "مارچ",
		        "اپریل",
		        "می",
		        "جون",
		        "جولای",
		        "اگست",
		        "سپتمبر",
		        "اکتوبر",
		        "نومبر",
		        "دسمبر"
		    ],
		    "month_names_abbreviated": [
		        "جنو",
		        "فوریهٔ",
		        "مارس",
		        "آوریل",
		        "مـی",
		        "ژوئن",
		        "جول",
		        "اوت",
		        "سپتامبر",
		        "اکتبر",
		        "نوامبر",
		        "دسم"
		    ],
		    "month_names_narrow": [
		        "ژ",
		        "ف",
		        "م",
		        "آ",
		        "م",
		        "ژ",
		        "ژ",
		        "ا",
		        "س",
		        "ا",
		        "ن",
		        "د"
		    ],
		    "day_names": [
		        "یکشنبه",
		        "دوشنبه",
		        "سه‌شنبه",
		        "چهارشنبه",
		        "پنجشنبه",
		        "جمعه",
		        "شنبه"
		    ],
		    "day_names_abbreviated": [
		        "یکشنبه",
		        "دوشنبه",
		        "سه‌شنبه",
		        "چهارشنبه",
		        "پنجشنبه",
		        "جمعه",
		        "شنبه"
		    ],
		    "day_names_short": [
		        "۱ش",
		        "۲ش",
		        "۳ش",
		        "۴ش",
		        "۵ش",
		        "ج",
		        "ش"
		    ],
		    "day_names_narrow": [
		        "ی",
		        "د",
		        "س",
		        "چ",
		        "پ",
		        "ج",
		        "ش"
		    ],
		    "day_periods": {
		        "afternoon": "عصر",
		        "am": "قبل‌ازظهر",
		        "earlyMorning": "بامداد",
		        "midDay": "بعدازظهر",
		        "morning": "صبح",
		        "night": "شب",
		        "noon": "ظهر",
		        "pm": "بعدازظهر",
		        "weeHours": "نیمه‌شب"
		    },
		    "day_periods_abbreviated": {
		        "afternoon": "عصر",
		        "am": "قبل‌ازظهر",
		        "earlyMorning": "بامداد",
		        "midDay": "بعدازظهر",
		        "morning": "صبح",
		        "night": "شب",
		        "noon": "ظهر",
		        "pm": "بعدازظهر",
		        "weeHours": "نیمه‌شب"
		    },
		    "day_periods_narrow": {
		        "am": "ق",
		        "noon": "ظ",
		        "pm": "ب"
		    },
		    "quarter_names": [
		        "سه‌ماههٔ اول",
		        "سه‌ماههٔ دوم",
		        "سه‌ماههٔ سوم",
		        "سه‌ماههٔ چهارم"
		    ],
		    "quarter_names_abbreviated": [
		        "س‌م۱",
		        "س‌م۲",
		        "س‌م۳",
		        "س‌م۴"
		    ],
		    "quarter_names_narrow": [
		        "۱",
		        "۲",
		        "۳",
		        "۴"
		    ],
		    "era_names": [
		        "قبل از میلاد",
		        "میلادی"
		    ],
		    "era_names_abbreviated": [
		        "ق.م.",
		        "م."
		    ],
		    "era_names_narrow": [
		        "ق",
		        "م"
		    ],
		    "full_format": "EEEE d MMMM y",
		    "long_format": "d MMMM y",
		    "medium_format": "d MMM y",
		    "short_format": "y/M/d",
		    "firstday_of_week": 6
		};
	}
})();