(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "Күнді таңдаңыз ...",
		        "buttonLabel": "Enter пернесін немесе Күнтізбені ашу үшін, бос орын пернесін басыңыз немесе",
		        "prevButtonLabel": "Өткен аймен өтіңіз",
		        "nextButtonLabel": "Келесі айға өту",
		        "closeButtonTitle": "Жақын",
		        "closeButtonLabel": "Күнтізбені жабыңыз",
		        "prevMonthButtonLabel": "Алдыңғы жылдың өтіңіз",
		        "prevYearButtonLabel": "Алдыңғы жиырма жылға өтіңіз",
		        "nextMonthButtonLabel": "Келесі жылдың өтіңіз",
		        "nextYearButtonLabel": "Келесі жиырма жыл өтіңіз",
		        "changeMonthButtonLabel": "Enter пернесін немесе ай өзгерту үшін бос орын пернесін басыңыз немесе",
		        "changeYearButtonLabel": "Enter пернесін немесе жыл өзгерту үшін бос орын пернесін басыңыз немесе",
		        "changeRangeButtonLabel": "Enter пернесін немесе келесі жиырма жылға өту үшін бос орын пернесін басыңыз немесе",
		        "calendarHelp": "- Жоғары КӨРСЕТКІ және ТӨМЕН КӨРСЕТКІ - тиісінше алдыңғы немесе келесі аптада аптаның сол күні барады. Айдың соңына жетті болса, тиісті жағдайларда Келесі немесе алдыңғы аймен ішіне жалғасуда.\r\n- Сол жақ көрсеткі және оң жақ көрсеткі - Сондай-ақ, тұтас, келесі бір күні алға. Кору Фокусты күн торына жолында жолдан алынған күні және ораулар күнге жылжытылады.\r\n- Бақылау + Page Up - өткен жылдың осындай күніне дейін жылжытады.\r\n- Бақылау + Page Down - келесі жылы сол күнге дейін жылжытады.\r\n- Басты бет - ағымдағы айдың бірінші күніне жылжытады.\r\n- End - ағымдағы айдың соңғы күніне жылжытады.\r\n- Page Up - өткен аймен сол күнге дейін жылжытады.\r\n- Page Down - келесі айдың сол күнге дейін жылжытады.\r\n- Енгізіңіз немесе Espace - күнтізбе жабылып, таңдалған күні байланысты мәтін жолағына шығады.\r\n- Escape - кез келген әрекеттер жоқ күнтізбені жабылады."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "қаңтар",
		        "ақпан",
		        "наурыз",
		        "сәуір",
		        "мамыр",
		        "маусым",
		        "шілде",
		        "тамыз",
		        "қыркүйек",
		        "қазан",
		        "қараша",
		        "желтоқсан"
		    ],
		    "month_names_abbreviated": [
		        "қаң.",
		        "ақп.",
		        "нау.",
		        "сәу.",
		        "мам.",
		        "мау.",
		        "шіл.",
		        "там.",
		        "қыр.",
		        "қаз.",
		        "қар.",
		        "желт."
		    ],
		    "month_names_narrow": [
		        "Қ",
		        "А",
		        "Н",
		        "С",
		        "М",
		        "М",
		        "Ш",
		        "Т",
		        "Қ",
		        "Қ",
		        "Қ",
		        "Ж"
		    ],
		    "day_names": [
		        "жексенбі",
		        "дүйсенбі",
		        "сейсенбі",
		        "сәрсенбі",
		        "бейсенбі",
		        "жұма",
		        "сенбі"
		    ],
		    "day_names_abbreviated": [
		        "жек",
		        "дүй",
		        "сей",
		        "сәр",
		        "бей",
		        "жұма",
		        "сен"
		    ],
		    "day_names_short": [
		        "жс",
		        "дс",
		        "сс",
		        "ср",
		        "бс",
		        "жм",
		        "сб"
		    ],
		    "day_names_narrow": [
		        "Ж",
		        "Д",
		        "С",
		        "С",
		        "Б",
		        "Ж",
		        "С"
		    ],
		    "day_periods": {
		        "am": "таңертеңгі",
		        "noon": "түскі",
		        "pm": "түстен кейінгі"
		    },
		    "day_periods_abbreviated": {
		        "am": "таңертеңгі",
		        "noon": "түскі",
		        "pm": "түстен кейінгі"
		    },
		    "day_periods_narrow": {
		        "am": "тт",
		        "noon": "тс",
		        "pm": "кш"
		    },
		    "quarter_names": [
		        "1-інші тоқсан",
		        "2-інші тоқсан",
		        "3-інші тоқсан",
		        "4-інші тоқсан"
		    ],
		    "quarter_names_abbreviated": [
		        "Т1",
		        "Т2",
		        "Т3",
		        "Т4"
		    ],
		    "quarter_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4"
		    ],
		    "era_names": [
		        "Біздің заманымызға дейін",
		        "Біздің заманымыз"
		    ],
		    "era_names_abbreviated": [
		        "б.з.д.",
		        "б.з."
		    ],
		    "era_names_narrow": [
		        "б.з.д.",
		        "б.з."
		    ],
		    "full_format": "EEEE, d MMMM y",
		    "long_format": "d MMMM y",
		    "medium_format": "y, dd-MMM",
		    "short_format": "dd/MM/yy",
		    "firstday_of_week": 0
		};
	}
})();