(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "ជ្រើស​កាល​បរិច្ឆេទ ...",
		        "buttonLabel": "ចុច​ឬ​ចុច Enter ឬ​ដកឃ្លា​ដើម្បី​បើក​ប្រតិទិន",
		        "prevButtonLabel": "ចូរ​ទៅ​ខែ​មុន",
		        "nextButtonLabel": "ចូល​ទៅ​កាន់​ការ​នៅ​ខែ​ក្រោយ",
		        "closeButtonTitle": "បិទ",
		        "closeButtonLabel": "បិទ​ប្រតិទិន",
		        "prevMonthButtonLabel": "ចូរ​ទៅ​ទៅ​នឹង​ឆ្នាំ​មុន",
		        "prevYearButtonLabel": "ចូរ​ទៅ​ម្ភៃ​ឆ្នាំ​មុន",
		        "nextMonthButtonLabel": "ចូរ​ទៅ​ឆ្នាំ​ក្រោយ",
		        "nextYearButtonLabel": "ចូរ​ទៅ​ពេល​ម្ភៃ​ឆ្នាំ",
		        "changeMonthButtonLabel": "ចុច​ឬ​ចុច Enter ឬ​ដកឃ្លា​ដើម្បី​ផ្លាស់​ប្តូ​ខែ​នេះ",
		        "changeYearButtonLabel": "ចុច​ឬ​ចុច Enter ឬ​ដកឃ្លា​ដើម្បី​ផ្លាស់​ប្តូ​រ​នៅ​ឆ្នាំ​នេះ",
		        "changeRangeButtonLabel": "ចុច​ឬ​ចុច Enter ឬ​ដកឃ្លា​ដើម្បី​ទៅ​កាន់​ពេល​ម្ភៃ​ឆ្នាំ",
		        "calendarHelp": "- ព្រួញ​ឡើង​លើ​និង​ព្រួញ​ចុះក្រោម - បាន​ទៅ​ថ្ងៃ​តែមួយ​ក្នុង​ស​ប្តា​ហ៍​នេះ​នៅ​ស​ប្តា​ហ៍​មុន​ឬ​បន្ទាប់​រៀង​។ បើ​សិន​ជា​នៅ​ចុង​ខែ​នេះ​ត្រូវ​បាន​ឈាន​ដល់​, បន្ត​នៅ​ខែ​ក្រោយ​ឬ​មុន​នេះ​ជា​ការ​សមរម្យ​។\r\n- ព្រួញ​ឆ្វេង​និង​ព្រួញ​ស្ដាំ - បុ​មួយ​ថ្ងៃ​ទៅ​បន្ទាប់​ទៀត​ផង​ដែរ​នៅ​ក្នុង​ការ​បន្ត​មួយ​។ ផ្តោ​ត​មើល​ឃើញ​ត្រូវ​បាន​ផ្លាស់ទី​ពី​មួយ​ថ្ងៃ​ទៅ​មួយ​ថ្ងៃ​ហើយ​បាន​បញ្ចប់​ពី​ជួរ​ដេក​ទៅ​កាន់​ជួរ​ដេក​នៅ​ក្នុង​ក្រឡាចត្រង្គ​នៃ​ថ្ងៃ​។\r\n- គ្រប់គ្រង + ទំព័រ​លើ - ផ្លាស់​ទី​ទៅ​ថ្ងៃ​ដដែល​នេះ​នៅ​ឆ្នាំ​មុន​។\r\n- គ្រប់គ្រង + ទំព័រ​ក្រោម - ផ្លាស់​ទី​ទៅ​ថ្ងៃ​ដដែល​នេះ​នៅ​ឆ្នាំ​ក្រោយ​។\r\n- ទំព័រ​ដើម - ផ្លាស់​ទី​ទៅ​នៅ​ថ្ងៃ​ទី​មួយ​នៃ​ខែ​បច្ចុប្បន្ន​។\r\n- បញ្ចប់ - ផ្លាស់​ទី​ទៅ​នៅ​ថ្ងៃ​ចុង​ក្រោយ​នៃ​ខែ​បច្ចុប្បន្ន​។\r\n- ឡើង​លើ​ទំព័រ - ផ្លាស់​ទី​ទៅ​ថ្ងៃ​ដដែល​នេះ​នៅ​ក្នុង​ខែ​មុន​នេះ​។\r\n- ទំព័រ​ចុះ - ផ្លាស់​ទី​ទៅ​ថ្ងៃ​ដដែល​នៅ​ខែ​ក្រោយ​នេះ​។\r\n- បញ្ចូល​ឬ Espace - បិទ​ប្រតិទិន​និង​កាលបរិច្ឆេទ​ដែល​បាន​ជ្រើស​ត្រូវ​បាន​បង្ហាញ​ក្នុង​ប្រអប់​អត្ថបទ​ដែល​ទាក់ទង​។\r\n- រត់​គេច​ខ្លួន - បិទ​ប្រតិទិន​ដោយ​គ្មាន​សកម្មភាព​ណា​មួយ​នោះ​ទេ​។"
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "មករា",
		        "កុម្ភៈ",
		        "មីនា",
		        "មេសា",
		        "ឧសភា",
		        "មិថុនា",
		        "កក្កដា",
		        "សីហា",
		        "កញ្ញា",
		        "តុលា",
		        "វិច្ឆិកា",
		        "ធ្នូ"
		    ],
		    "month_names_abbreviated": [
		        "មករា",
		        "កុម្ភៈ",
		        "មីនា",
		        "មេសា",
		        "ឧសភា",
		        "មិថុនា",
		        "កក្កដា",
		        "សីហា",
		        "កញ្ញា",
		        "តុលា",
		        "វិច្ឆិកា",
		        "ធ្នូ"
		    ],
		    "month_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4",
		        "5",
		        "6",
		        "7",
		        "8",
		        "9",
		        "10",
		        "11",
		        "12"
		    ],
		    "day_names": [
		        "អាទិត្យ",
		        "ចន្ទ",
		        "អង្គារ",
		        "ពុធ",
		        "ព្រហស្បតិ៍",
		        "សុក្រ",
		        "សៅរ៍"
		    ],
		    "day_names_abbreviated": [
		        "អាទិត្យ",
		        "ចន្ទ",
		        "អង្គារ",
		        "ពុធ",
		        "ព្រហស្បតិ៍",
		        "សុក្រ",
		        "សៅរ៍"
		    ],
		    "day_names_short": [
		        "អាទិត្យ",
		        "ចន្ទ",
		        "អង្គារ",
		        "ពុធ",
		        "ព្រហស្បតិ៍",
		        "សុក្រ",
		        "សៅរ៍"
		    ],
		    "day_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4",
		        "5",
		        "6",
		        "7"
		    ],
		    "day_periods": {
		        "am": "ព្រឹក",
		        "noon": "ថ្ងៃ",
		        "pm": "ល្ងាច"
		    },
		    "day_periods_abbreviated": {
		        "am": "ព្រឹក",
		        "noon": "ថ្ងៃ",
		        "pm": "ល្ងាច"
		    },
		    "day_periods_narrow": {
		        "am": "ព្រឹក",
		        "noon": "ថ្ងៃ",
		        "pm": "ល្ងាច"
		    },
		    "quarter_names": [
		        "ត្រីមាសទី ១",
		        "ត្រីមាសទី ២",
		        "ត្រីមាសទី ៣",
		        "ត្រីមាសទី ៤"
		    ],
		    "quarter_names_abbreviated": [
		        "ត្រីមាសទី ១",
		        "ត្រីមាសទី ២",
		        "ត្រីមាសទី ៣",
		        "ត្រីមាសទី ៤"
		    ],
		    "quarter_names_narrow": [
		        "១",
		        "២",
		        "៣",
		        "៤"
		    ],
		    "era_names": [
		        "មុន​គ្រិស្តសករាជ",
		        "គ្រិស្តសករាជ"
		    ],
		    "era_names_abbreviated": [
		        "មុន គ.ស.",
		        "គ.ស."
		    ],
		    "era_names_narrow": [
		        "មុន គ.ស.",
		        "គ.ស."
		    ],
		    "full_format": "EEEE d MMMM y",
		    "long_format": "d MMMM y",
		    "medium_format": "d MMM y",
		    "short_format": "d/M/yy",
		    "firstday_of_week": 0
		};
	}
})();