(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "ເລືອກ​ວັນ​ທີ່ ...",
		        "buttonLabel": "ກົດ​ຫລື​ກົດ​ປຸ່ມ Enter ຫຼື spacebar ໃນ​ການ​ເປີດ​ການ​ປະ​ຕິ​ທິນ",
		        "prevButtonLabel": "ໄປ​ເດືອນ​ທີ່​ຜ່ານ​ມາ",
		        "nextButtonLabel": "ໄປ​ເດືອນ​ຕໍ່​ໄປ",
		        "closeButtonTitle": "ປິດ",
		        "closeButtonLabel": "ປິດ​ການ​ປະ​ຕິ​ທິນ",
		        "prevMonthButtonLabel": "ໄປ​ກັບ​ປີ​ທີ່​ຜ່ານ​ມາ",
		        "prevYearButtonLabel": "ໄປ​ທີ່​ຜ່ານ​ມາ​ຊາວ​ປີ",
		        "nextMonthButtonLabel": "ໄປ​ໃນ​ປີ​ຕໍ່​ໄປ",
		        "nextYearButtonLabel": "ໄປ​ຕໍ່​ຊາວ​ປີ",
		        "changeMonthButtonLabel": "ກົດ​ຫລື​ກົດ​ປຸ່ມ Enter ຫຼື spacebar ໄດ້​ມີ​ການ​ປ່ຽນ​ແປງ​ເດືອນ",
		        "changeYearButtonLabel": "ກົດ​ຫລື​ກົດ​ປຸ່ມ Enter ຫຼື spacebar ໄດ້​ມີ​ການ​ປ່ຽນ​ແປງ​ປີ",
		        "changeRangeButtonLabel": "ກົດ​ຫຼື​ກົດ​ທີ່​ສໍາ​ຄັນ​ຫຼື spacebar ໄດ້​ກະ​ລຸ​ນາ​ໃສ່​ທີ່​ຈະ​ໄປ​ຕໍ່​ໄປ​ຊາວ​ປີ",
		        "calendarHelp": "- ລູກ​ສອນ​ຂຶ້ນ​ແລະ​ລູກ​ສອນ​ລົງ - ໄປ​ໃນ​ມື້​ດຽວ​ກັນ​ຂອງ​ອາ​ທິດ​ໃນ​ອາ​ທິດ​ທີ່​ຜ່ານ​ມາ​ຫຼື​ຕໍ່​ໄປ​ຕາມ​ລໍາ​ດັບ​. ຖ້າ​ຫາກ​ວ່າ​ໃນ​ຕອນ​ທ້າຍ​ຂອງ​ເດືອນ​ນັ້ນ​ແມ່ນ​ບັນ​ລຸ​ໄດ້​, ຍັງ​ຈະ​ສືບ​ຕໍ່​ເຂົ້າ​ໄປ​ໃນ​ເດືອນ​ຕໍ່​ໄປ​ຫຼື​ກ່ອນ​ຫນ້າ​ຕາມ​ຄວາມ​ເຫມາະ​ສົມ​.\r\n- ລູກ​ສອນ​ຊ້າຍ​ແລະ​ລູກ​ສອນ​ສິດ - ຄວາມ​ກ້າວ​ຫນ້າ​ຂອງ​ມື້​ຫນຶ່ງ​ກັບ​ການ​ຕໍ່​ໄປ​, ຍັງ​ຢູ່​ໃນ​ການ​ຕໍ່​ເນື່ອງ​ໄດ້​. ຈຸດ​ສຸມ​ສາຍ​ຕາ​ໄດ້​ຖືກ​ຍ້າຍ​ຈາກ​ລະ​ມື້​ລະ​ວັນ​ແລະ wraps ຈາກ​ຕິດ​ຕໍ່​ກັນ​ຕິດ​ຕໍ່​ກັນ​ໃນ​ຕາ​ຂ່າຍ​ໄຟ​ຟ້າ​ຂອງ​ມື້​ໄດ້​.\r\n- ການ​ຄວບ​ຄຸມ + ຫນ້າ Up - ຍ້າຍ​ໄປ​ໃນ​ວັນ​ທີ​ທີ່​ດຽວ​ກັນ​ໃນ​ປີ​ທີ່​ຜ່ານ​ມາ​.\r\n- ການ​ຄວບ​ຄຸມ + ຫນ້າ​ລົງ - ຍ້າຍ​ໄປ​ໃນ​ວັນ​ທີ​ທີ່​ດຽວ​ກັນ​ໃນ​ປີ​ຕໍ່​ໄປ​.\r\n- ຫນ້າ​ທໍາ​ອິດ - ການ​ເຄື່ອນ​ໄຫວ​ໄປ​ໃນ​ມື້​ທໍາ​ອິດ​ຂອງ​ເດືອນ​ໃນ​ປະ​ຈຸ​ບັນ​.\r\n- ສຸດ​ທ້າຍ - ການ​ເຄື່ອນ​ໄຫວ​ໄປ​ມື້​ສຸດ​ທ້າຍ​ຂອງ​ເດືອນ​ໃນ​ປະ​ຈຸ​ບັນ​.\r\n- ຫນ້າ Up - ການ​ເຄື່ອນ​ໄຫວ​ໃນ​ວັນ​ດຽວ​ກັນ​ໃນ​ເດືອນ​ທີ່​ຜ່ານ​ມາ​.\r\n- ຫນ້າ​ລົງ - ການ​ເຄື່ອນ​ໄຫວ​ໃນ​ວັນ​ດຽວ​ກັນ​ໃນ​ເດືອນ​ຕໍ່​ໄປ​.\r\n- ກະ​ລຸ​ນາ​ໃສ່​ຫຼື Espace - ກັບ​ການ​ປະ​ຕິ​ທິນ​, ແລະ​ວັນ​ທີ​ທີ່​ການ​ຄັດ​ເລືອກ​ສະ​ແດງ​ໃຫ້​ເຫັນ​ໃນ​ກ່ອງ​ຂໍ້​ຄວາມ​ທີ່​ກ່ຽວ​ຂ້ອງ​.\r\n- Escape - ກັບ​ການ​ປະ​ຕິ​ທິນ​ໂດຍ​ບໍ່​ມີ​ການ​ດໍາ​ເນີນ​ການ​ໃດໆ​ໄດ້​."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "ມັງກອນ",
		        "ກຸມພາ",
		        "ມີນາ",
		        "ເມສາ",
		        "ພຶດສະພາ",
		        "ມິຖຸນາ",
		        "ກໍລະກົດ",
		        "ສິງຫາ",
		        "ກັນຍາ",
		        "ຕຸລາ",
		        "ພະຈິກ",
		        "ທັນວາ"
		    ],
		    "month_names_abbreviated": [
		        "ມ.ກ.",
		        "ກ.ພ.",
		        "ມ.ນ.",
		        "ມ.ສ.",
		        "ພ.ພ.",
		        "ມິ.ຖ.",
		        "ກ.ລ.",
		        "ສ.ຫ.",
		        "ກ.ຍ.",
		        "ຕ.ລ.",
		        "ພ.ຈ.",
		        "ທ.ວ."
		    ],
		    "month_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4",
		        "5",
		        "6",
		        "7",
		        "8",
		        "9",
		        "10",
		        "11",
		        "12"
		    ],
		    "day_names": [
		        "ວັນອາທິດ",
		        "ວັນຈັນ",
		        "ວັນອັງຄານ",
		        "ວັນພຸດ",
		        "ວັນພະຫັດ",
		        "ວັນສຸກ",
		        "ວັນເສົາ"
		    ],
		    "day_names_abbreviated": [
		        "ວັນອາທິດ",
		        "ວັນຈັນ",
		        "ວັນອັງຄານ",
		        "ວັນພຸດ",
		        "ວັນພະຫັດ",
		        "ວັນສຸກ",
		        "ວັນເສົາ"
		    ],
		    "day_names_short": [
		        "ອາ.",
		        "ຈ.",
		        "ອ.",
		        "ພ.",
		        "ພຫ.",
		        "ສຸ.",
		        "ສ."
		    ],
		    "day_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4",
		        "5",
		        "6",
		        "7"
		    ],
		    "day_periods": {
		        "am": "ກ່ອນທ່ຽງ",
		        "noon": "ທ່ຽງ",
		        "pm": "ຫຼັງທ່ຽງ"
		    },
		    "day_periods_abbreviated": {
		        "am": "ກ່ອນທ່ຽງ",
		        "noon": "ທ່ຽງ",
		        "pm": "ຫຼັງທ່ຽງ"
		    },
		    "day_periods_narrow": {
		        "am": "ກທ",
		        "noon": "ທ",
		        "pm": "ຫຼທ"
		    },
		    "quarter_names": [
		        "ໄຕຣມາດ 1",
		        "ໄຕຣມາດ 2",
		        "ໄຕຣມາດ 3",
		        "ໄຕຣມາດ 4"
		    ],
		    "quarter_names_abbreviated": [
		        "ຕມ1",
		        "ຕມ2",
		        "ຕມ3",
		        "ຕມ4"
		    ],
		    "quarter_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4"
		    ],
		    "era_names": [
		        "ກ່ອນຄຣິດສັກກະລາດ",
		        "ຄຣິດສັກກະລາດ"
		    ],
		    "era_names_abbreviated": [
		        "ກ່ອນ ຄ.ສ.",
		        "ຄ.ສ."
		    ],
		    "era_names_narrow": [
		        "ກ່ອນ ຄ.ສ.",
		        "ຄ.ສ."
		    ],
		    "full_format": "EEEE ທີ d MMMM G y",
		    "long_format": "d MMMM y",
		    "medium_format": "d MMM y",
		    "short_format": "d/M/y",
		    "firstday_of_week": 0
		};
	}
})();