(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "Одберете датум ...",
		        "buttonLabel": "Кликнете или притиснете на Enter копчето или на spacebar за да го отворите календарот",
		        "prevButtonLabel": "Оди на претходниот месец",
		        "nextButtonLabel": "Одете на следниот месец",
		        "closeButtonTitle": "Затвори",
		        "closeButtonLabel": "Затвори календарот",
		        "prevMonthButtonLabel": "Оди на претходната година",
		        "prevYearButtonLabel": "Оди на претходната дваесет години",
		        "nextMonthButtonLabel": "Да одат во следната година",
		        "nextYearButtonLabel": "Одат во следните дваесет години",
		        "changeMonthButtonLabel": "Кликнете или притиснете на Enter копчето или на празно место да се промени на месец",
		        "changeYearButtonLabel": "Кликнете или притиснете на Enter копчето или на празно место да се промени на годината",
		        "changeRangeButtonLabel": "Кликнете или притиснете на Enter копчето или на празно место да се оди на следното дваесет години",
		        "calendarHelp": "- Стрелка нагоре и надолу стрелките - оди на истиот ден од неделата во претходната или следната недела, соодветно. Доколку не се постигне до крајот на месецот, продолжува во следната или претходната месец како што е соодветно.\r\n- Left Arrow и десно стрелките - аванси еден ден до следниот, исто така, во континуитет. Визуелно фокус е преместена од ден на ден и обвива од ред до ред, во мрежата на денови.\r\n- Control + Page Up - Движење на истиот датум во претходната година.\r\n- Control + Page Down - Движење на истиот датум во текот на следната година.\r\n- Насловна - Ве носи на првиот ден од тековниот месец.\r\n- Енд - Движење на последниот ден од тековниот месец.\r\n- Страница Нагоре - Движење на истиот датум во претходниот месец.\r\n- Страница надолу - се движи на истиот датум во следниот месец.\r\n- Внесете или Espace - затвора календар и тој датум ќе се прикажани во полето за текст поврзан.\r\n- Бегство - затвора календар без било каква акција."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "јануари",
		        "февруари",
		        "март",
		        "април",
		        "мај",
		        "јуни",
		        "јули",
		        "август",
		        "септември",
		        "октомври",
		        "ноември",
		        "декември"
		    ],
		    "month_names_abbreviated": [
		        "јан.",
		        "фев.",
		        "мар.",
		        "апр.",
		        "мај",
		        "јун.",
		        "јул.",
		        "авг.",
		        "септ.",
		        "окт.",
		        "ноем.",
		        "дек."
		    ],
		    "month_names_narrow": [
		        "ј",
		        "ф",
		        "м",
		        "а",
		        "м",
		        "ј",
		        "ј",
		        "а",
		        "с",
		        "о",
		        "н",
		        "д"
		    ],
		    "day_names": [
		        "недела",
		        "понеделник",
		        "вторник",
		        "среда",
		        "четврток",
		        "петок",
		        "сабота"
		    ],
		    "day_names_abbreviated": [
		        "нед.",
		        "пон.",
		        "вт.",
		        "сре.",
		        "чет.",
		        "пет.",
		        "саб."
		    ],
		    "day_names_short": [
		        "нед.",
		        "пон.",
		        "вт.",
		        "сре.",
		        "чет.",
		        "пет.",
		        "саб."
		    ],
		    "day_names_narrow": [
		        "н",
		        "п",
		        "в",
		        "с",
		        "ч",
		        "п",
		        "с"
		    ],
		    "day_periods": {
		        "am": "претпладне",
		        "noon": "на пладне",
		        "pm": "попладне"
		    },
		    "day_periods_abbreviated": {
		        "am": "претпладне",
		        "noon": "на пладне",
		        "pm": "попладне"
		    },
		    "day_periods_narrow": {
		        "am": "прет.",
		        "noon": "напл.",
		        "pm": "попл."
		    },
		    "quarter_names": [
		        "прво тромесечје",
		        "второ тромесечје",
		        "трето тромесечје",
		        "четврто тромесечје"
		    ],
		    "quarter_names_abbreviated": [
		        "јан-мар",
		        "апр-јун",
		        "јул-сеп",
		        "окт-дек"
		    ],
		    "quarter_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4"
		    ],
		    "era_names": [
		        "пред нашата ера",
		        "од нашата ера"
		    ],
		    "era_names_abbreviated": [
		        "пр.н.е.",
		        "н.е."
		    ],
		    "era_names_narrow": [
		        "пр. н.е.",
		        "н.е."
		    ],
		    "full_format": "EEEE, dd MMMM y",
		    "long_format": "dd MMMM y",
		    "medium_format": "dd.M.y",
		    "short_format": "dd.M.yy",
		    "firstday_of_week": 1
		};
	}
})();