(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "തീയതി തിരഞ്ഞെടുക്കുക ...",
		        "buttonLabel": "നൽകുക കീ അല്ലെങ്കിൽ കലണ്ടർ തുറക്കാൻ സ്പെയ്സ് ക്ലിക്ക് അല്ലെങ്കിൽ അമർത്തുക",
		        "prevButtonLabel": "കഴിഞ്ഞ മാസം പോകുക",
		        "nextButtonLabel": "അടുത്ത മാസം പോകുക",
		        "closeButtonTitle": "അടയ്ക്കുക",
		        "closeButtonLabel": "കലണ്ടർ അടയ്ക്കുക",
		        "prevMonthButtonLabel": "മുൻ വർഷം പോകുക",
		        "prevYearButtonLabel": "മുൻ ഇരുപതു വർഷം പോകുക",
		        "nextMonthButtonLabel": "അടുത്ത വർഷം പോകുക",
		        "nextYearButtonLabel": "അടുത്ത ഇരുപതു വർഷം പോകുക",
		        "changeMonthButtonLabel": "നൽകുക കീ അല്ലെങ്കിൽ മാസം മാറ്റുന്നതിന് സ്പെയ്സ് ക്ലിക്ക് അല്ലെങ്കിൽ അമർത്തുക",
		        "changeYearButtonLabel": "നൽകുക കീ അല്ലെങ്കിൽ വർഷം മാറ്റുന്നതിന് സ്പെയ്സ് ക്ലിക്ക് അല്ലെങ്കിൽ അമർത്തുക",
		        "changeRangeButtonLabel": "നൽകുക കീ അല്ലെങ്കിൽ അടുത്ത ഇരുപതു വർഷം പോകാൻ സ്പെയ്സ് ക്ലിക്ക് അല്ലെങ്കിൽ അമർത്തുക",
		        "calendarHelp": "- മുകളിലേക്കുള്ള അമ്പടയാളം, Down ആരോ - യഥാക്രമം മുൻ അല്ലെങ്കിൽ അടുത്ത ആഴ്ചയിൽ ആഴ്ചയിലെ ഒരേ ദിവസം പോകുന്നു. മാസം അവസാനിക്കാറായി ആണെങ്കിൽ, അനുയോജ്യമായ അടുത്ത ആയ മുൻ മാസം കടന്നു തുടരുന്നു.\r\n- ഇടത് ആരോ റൈറ്റ് അമ്പടയാളം - പുറമേ ഒരു continuum ൽ, അടുത്ത ഒരു ദിവസം മുന്നോട്ട്. കാഴ്ചയ്ക്ക് ഫോക്കസ് ദിവസങ്ങളുടെ ഗ്രിഡിലെ വരികളുടെയും വരി നിന്ന് പകൽ, മഞ്ജൂ പകലിനെ നീങ്ങുന്നു.\r\n- നിയന്ത്രണ + പേജ് മുകളിലേയ്ക്ക് - മുൻ വർഷം ഇതേ തീയതി പോകുന്നു.\r\n- നിയന്ത്രണ + പേജ് താഴേക്കുള്ള - അടുത്ത വർഷം ഇതേ തീയതി പോകുന്നു.\r\n- ഹോം - നിലവിലെ മാസം ഒന്നാം തിയ്യതി പോകുന്നു.\r\n- എൻഡ് - നിലവിലെ മാസത്തിലെ അവസാന ദിവസം പോകുന്നു.\r\n- പേജ് മുകളിലേയ്ക്ക് - മുൻ മാസം ഇതേ തീയതി പോകുന്നു.\r\n- പേജുകൾ - അടുത്ത മാസം ഇതേ തീയതി പോകുന്നു.\r\n- നൽകുക അല്ലെങ്കിൽ Espace - കലണ്ടർ അടയുന്നു, തിരഞ്ഞെടുത്ത തീയതി ബന്ധപ്പെട്ട ടെക്സ്റ്റ് ബോക്സിൽ കാണുന്നതുപോലെ.\r\n- എസ്കേപ്പ് - യാതൊരു നടപടിയും കൂടാതെ കലണ്ടർ അടയ്ക്കുന്നു."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "ജനുവരി",
		        "ഫെബ്രുവരി",
		        "മാർച്ച്",
		        "ഏപ്രിൽ",
		        "മേയ്",
		        "ജൂൺ",
		        "ജൂലൈ",
		        "ആഗസ്റ്റ്",
		        "സെപ്റ്റംബർ",
		        "ഒക്‌ടോബർ",
		        "നവംബർ",
		        "ഡിസംബർ"
		    ],
		    "month_names_abbreviated": [
		        "ജനു",
		        "ഫെബ്രു",
		        "മാർ",
		        "ഏപ്രി",
		        "മേയ്",
		        "ജൂൺ",
		        "ജൂലൈ",
		        "ഓഗ",
		        "സെപ്റ്റം",
		        "ഒക്ടോ",
		        "നവം",
		        "ഡിസം"
		    ],
		    "month_names_narrow": [
		        "ജ",
		        "ഫ",
		        "മാ",
		        "ഏ",
		        "മെ",
		        "ജൂ",
		        "ജൂ",
		        "ഓ",
		        "സ",
		        "ഒ",
		        "ന",
		        "ഡി"
		    ],
		    "day_names": [
		        "ഞായറാഴ്‌ച",
		        "തിങ്കളാഴ്‌ച",
		        "ചൊവ്വാഴ്ച",
		        "ബുധനാഴ്‌ച",
		        "വ്യാഴാഴ്‌ച",
		        "വെള്ളിയാഴ്‌ച",
		        "ശനിയാഴ്‌ച"
		    ],
		    "day_names_abbreviated": [
		        "ഞായർ",
		        "തിങ്കൾ",
		        "ചൊവ്വ",
		        "ബുധൻ",
		        "വ്യാഴം",
		        "വെള്ളി",
		        "ശനി"
		    ],
		    "day_names_short": [
		        "ഞാ",
		        "തി",
		        "ചൊ",
		        "ബു",
		        "വ്യാ",
		        "വെ",
		        "ശ"
		    ],
		    "day_names_narrow": [
		        "ഞ",
		        "തി",
		        "ച",
		        "ബു",
		        "വ",
		        "വെ",
		        "ശ"
		    ],
		    "day_periods": {
		        "am": "AM",
		        "noon": "ഉച്ച",
		        "pm": "PM"
		    },
		    "day_periods_abbreviated": {
		        "am": "AM",
		        "noon": "ഉച്ച",
		        "pm": "PM"
		    },
		    "day_periods_narrow": {
		        "am": "AM",
		        "noon": "ഉച്ച",
		        "pm": "PM"
		    },
		    "quarter_names": [
		        "ഒന്നാം പാദം",
		        "രണ്ടാം പാദം",
		        "മൂന്നാം പാദം",
		        "നാലാം പാദം"
		    ],
		    "quarter_names_abbreviated": [
		        "ഒന്നാം പാദം",
		        "രണ്ടാം പാദം",
		        "മൂന്നാം പാദം",
		        "നാലാം പാദം"
		    ],
		    "quarter_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4"
		    ],
		    "era_names": [
		        "ക്രിസ്‌തുവിന് മുമ്പ്",
		        "ആന്നോ ഡൊമിനി"
		    ],
		    "era_names_abbreviated": [
		        "ക്രി.മു.",
		        "എഡി"
		    ],
		    "era_names_narrow": [
		        "ക്രി.മു.",
		        "എഡി"
		    ],
		    "full_format": "y, MMMM d, EEEE",
		    "long_format": "y, MMMM d",
		    "medium_format": "y, MMM d",
		    "short_format": "dd/MM/yy",
		    "firstday_of_week": 0
		};
	}
})();