(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "तारीख निवडा ...",
		        "buttonLabel": "क्लिक करा किंवा एंटर दाबा किंवा स्पेसबार कॅलेंडर उघडण्यासाठी",
		        "prevButtonLabel": "मागील महिन्यात जा",
		        "nextButtonLabel": "पुढील महिन्यात जा",
		        "closeButtonTitle": "बंद करा",
		        "closeButtonLabel": "कॅलेंडर बंद करा",
		        "prevMonthButtonLabel": "मागील वर्षी जा",
		        "prevYearButtonLabel": "मागील वीस वर्षे जा",
		        "nextMonthButtonLabel": "पुढील वर्षी जा",
		        "nextYearButtonLabel": "पुढे वीस वर्षे जा",
		        "changeMonthButtonLabel": "क्लिक करा किंवा एंटर दाबा किंवा स्पेसबार महिन्यात बदलण्यासाठी",
		        "changeYearButtonLabel": "क्लिक करा किंवा एंटर दाबा किंवा स्पेसबार वर्षी बदलण्यासाठी",
		        "changeRangeButtonLabel": "क्लिक करा किंवा पुढे वीस वर्षे जाण्यासाठी की किंवा स्पेसबार Enter दाबा",
		        "calendarHelp": "- वर बाण आणि Down बाण - अनुक्रमे मागील किंवा पुढील आठवड्यात आठवड्यात त्याच दिवशी ला. महिन्याच्या शेवटी गाठली आहे, तर योग्य पुढील किंवा मागील महिन्यात मध्ये आहे.\r\n- डावा बाण आणि उजवा बाण - एक अखंड मध्ये, पुढील एक दिवस जाईल. अंध लक्ष केंद्रित रोज हलविले आणि दिवस ग्रिड मध्ये आवलणे पंक्ती अलाहबाद आहे.\r\n- नियंत्रण + पृष्ठ अप - मागील वर्षी त्याच तारखेला ला.\r\n- नियंत्रण + पृष्ठ खाली - पुढील वर्षी त्याच तारखेला ला.\r\n- मुख्यपृष्ठ - वर्तमान महिन्याच्या पहिल्या दिवशी नाही.\r\n- समाप्त - वर्तमान महिन्याच्या शेवटच्या दिवशी नाही.\r\n- पृष्ठ वर - गेल्या महिन्यात त्याच तारखेला ला.\r\n- पृष्ठ खाली - पुढील महिन्यात त्याच तारखेला ला.\r\n- प्रविष्ट करा किंवा ईस्पेस - दिनदर्शिका बंद होते, आणि निवडलेली तारीख संबंधित मजकूर बॉक्स मध्ये दिसत आहे.\r\n- सुटलेला - कोणतीही क्रिया न करता कॅलेंडर बंद होते."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "जानेवारी",
		        "फेब्रुवारी",
		        "मार्च",
		        "एप्रिल",
		        "मे",
		        "जून",
		        "जुलै",
		        "ऑगस्ट",
		        "सप्टेंबर",
		        "ऑक्टोबर",
		        "नोव्हेंबर",
		        "डिसेंबर"
		    ],
		    "month_names_abbreviated": [
		        "जाने",
		        "फेब्रु",
		        "मार्च",
		        "एप्रि",
		        "मे",
		        "जून",
		        "जुलै",
		        "ऑग",
		        "सप्टें",
		        "ऑक्टो",
		        "नोव्हें",
		        "डिसें"
		    ],
		    "month_names_narrow": [
		        "जा",
		        "फे",
		        "मा",
		        "ए",
		        "मे",
		        "जू",
		        "जु",
		        "ऑ",
		        "स",
		        "ऑ",
		        "नो",
		        "डि"
		    ],
		    "day_names": [
		        "रविवार",
		        "सोमवार",
		        "मंगळवार",
		        "बुधवार",
		        "गुरुवार",
		        "शुक्रवार",
		        "शनिवार"
		    ],
		    "day_names_abbreviated": [
		        "रवि",
		        "सोम",
		        "मंगळ",
		        "बुध",
		        "गुरु",
		        "शुक्र",
		        "शनि"
		    ],
		    "day_names_short": [
		        "र",
		        "सो",
		        "मं",
		        "बु",
		        "गु",
		        "शु",
		        "श"
		    ],
		    "day_names_narrow": [
		        "र",
		        "सो",
		        "मं",
		        "बु",
		        "गु",
		        "शु",
		        "श"
		    ],
		    "day_periods": {
		        "am": "म.पू.",
		        "noon": "मध्यान्ह",
		        "pm": "म.उ."
		    },
		    "day_periods_abbreviated": {
		        "am": "AM",
		        "noon": "मध्यान्ह",
		        "pm": "PM"
		    },
		    "day_periods_narrow": {
		        "am": "स",
		        "noon": "दु",
		        "pm": "सं"
		    },
		    "quarter_names": [
		        "प्रथम तिमाही",
		        "द्वितीय तिमाही",
		        "तृतीय तिमाही",
		        "चतुर्थ तिमाही"
		    ],
		    "quarter_names_abbreviated": [
		        "ति१",
		        "ति२",
		        "ति३",
		        "ति४"
		    ],
		    "quarter_names_narrow": [
		        "१",
		        "२",
		        "३",
		        "४"
		    ],
		    "era_names": [
		        "ईसवीसनपूर्व",
		        "ईसवीसन"
		    ],
		    "era_names_abbreviated": [
		        "इ. स. पू.",
		        "इ. स."
		    ],
		    "era_names_narrow": [
		        "इ. स. पू.",
		        "इ. स."
		    ],
		    "full_format": "EEEE, d MMMM, y",
		    "long_format": "d MMMM, y",
		    "medium_format": "d MMM, y",
		    "short_format": "d/M/yy",
		    "firstday_of_week": 0
		};
	}
})();