(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "मिति छान्नुहोस् ...",
		        "buttonLabel": "क्लिक गर्नुहोस् वा कुञ्जी प्रेस वा स्पेसबार क्यालेन्डर खोल्न",
		        "prevButtonLabel": "अघिल्लो महिना जानुहोस्",
		        "nextButtonLabel": "अर्को महिना जानुहोस्",
		        "closeButtonTitle": "बन्द",
		        "closeButtonLabel": "क्यालेन्डर बन्द",
		        "prevMonthButtonLabel": "अघिल्लो वर्ष जानुहोस्",
		        "prevYearButtonLabel": "अघिल्लो बीस वर्ष जानुहोस्",
		        "nextMonthButtonLabel": "अर्को वर्ष जानुहोस्",
		        "nextYearButtonLabel": "अर्को बीस वर्ष जानुहोस्",
		        "changeMonthButtonLabel": "क्लिक गर्नुहोस् वा कुञ्जी प्रेस वा स्पेसबार महिनाको परिवर्तन गर्न",
		        "changeYearButtonLabel": "क्लिक गर्नुहोस् वा कुञ्जी प्रेस वा स्पेसबार वर्ष परिवर्तन गर्न",
		        "changeRangeButtonLabel": "क्लिक गर्नुहोस् वा अर्को बीस वर्ष जान कुञ्जी वा स्पेसबार दर्ज प्रेस",
		        "calendarHelp": "- तीर र तल तीर - क्रमशः अघिल्लो वा अर्को हप्ता मा सप्ताह को नै दिन जान्छ। महिनाको अन्त पुगेको छ भने, उपयुक्त रूपमा अर्को वा अघिल्लो महिना मा जारी।\r\n- बायाँ तीर र दाँया तीर - पनि एक Continuum मा, अर्को एक दिन अग्रिम। नेत्रहीन ध्यान दिन दिन देखि उत्प्रेरित र दिन को ग्रिड मा पङ्क्ति गर्न पङ्क्ति देखि wraps छ।\r\n- नियन्त्रण + पृष्ठ माथि - अघिल्लो वर्ष नै मिति गर्न उत्प्रेरित गर्छ।\r\n- नियन्त्रण + पृष्ठ तल - अर्को वर्ष नै मिति गर्न उत्प्रेरित गर्छ।\r\n- घर - हालको महिनाको पहिलो दिन उत्प्रेरित गर्छ।\r\n- अन्त - हालको महिनाको अन्तिम दिन उत्प्रेरित गर्छ।\r\n- पृष्ठ माथि - अघिल्लो महिना मा नै मिति गर्न उत्प्रेरित गर्छ।\r\n- पृष्ठ तल - अर्को महिना मा नै मिति गर्न उत्प्रेरित गर्छ।\r\n- दर्ज वा ESPACE - क्यालेन्डर बंद, र चयन मिति संबद्ध पाठ बक्स मा देखाइएको छ।\r\n- भागन - कुनै पनि कार्य बिना पात्रो बंद।"
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "जनवरी",
		        "फेब्रुअरी",
		        "मार्च",
		        "अप्रिल",
		        "मई",
		        "जुन",
		        "जुलाई",
		        "अगस्ट",
		        "सेप्टेम्बर",
		        "अक्टोबर",
		        "नोभेम्बर",
		        "डिसेम्बर"
		    ],
		    "month_names_abbreviated": [
		        "जनवरी",
		        "फेब्रुअरी",
		        "मार्च",
		        "अप्रिल",
		        "मे",
		        "जुन",
		        "जुलाई",
		        "अगस्ट",
		        "सेप्टेम्बर",
		        "अक्टोबर",
		        "नोभेम्बर",
		        "डिसेम्बर"
		    ],
		    "month_names_narrow": [
		        "१",
		        "२",
		        "३",
		        "४",
		        "५",
		        "६",
		        "७",
		        "८",
		        "९",
		        "१०",
		        "११",
		        "१२"
		    ],
		    "day_names": [
		        "आइतबार",
		        "सोमबार",
		        "मङ्गलबार",
		        "बुधबार",
		        "बिहिबार",
		        "शुक्रबार",
		        "शनिबार"
		    ],
		    "day_names_abbreviated": [
		        "आइत",
		        "सोम",
		        "मङ्गल",
		        "बुध",
		        "बिही",
		        "शुक्र",
		        "शनि"
		    ],
		    "day_names_short": [
		        "आइत",
		        "सोम",
		        "मङ्गल",
		        "बुध",
		        "बिही",
		        "शुक्र",
		        "शनि"
		    ],
		    "day_names_narrow": [
		        "आ",
		        "सो",
		        "म",
		        "बु",
		        "बि",
		        "शु",
		        "श"
		    ],
		    "day_periods": {
		        "am": "पूर्वाह्न",
		        "noon": "मध्यान्ह",
		        "pm": "अपराह्न"
		    },
		    "day_periods_abbreviated": {
		        "am": "पूर्वाह्न",
		        "noon": "मध्यान्ह",
		        "pm": "अपराह्न"
		    },
		    "day_periods_narrow": {
		        "am": "a",
		        "noon": "n",
		        "pm": "p"
		    },
		    "quarter_names": [
		        "पहिलो सत्र",
		        "दोस्रो सत्र",
		        "तेस्रो सत्र",
		        "चौथो सत्र"
		    ],
		    "quarter_names_abbreviated": [
		        "पहिलो सत्र",
		        "दोस्रो सत्र",
		        "तेस्रो सत्र",
		        "चौथो सत्र"
		    ],
		    "quarter_names_narrow": [
		        "१",
		        "२",
		        "३",
		        "४"
		    ],
		    "era_names": [
		        "ईसा पूर्व",
		        "सन्"
		    ],
		    "era_names_abbreviated": [
		        "ईसा पूर्व",
		        "सन्"
		    ],
		    "era_names_narrow": [
		        "ईसा पूर्व",
		        "सन्"
		    ],
		    "full_format": "y MMMM d, EEEE",
		    "long_format": "y MMMM d",
		    "medium_format": "y MMM d",
		    "short_format": "y-MM-dd",
		    "firstday_of_week": 0
		};
	}
})();