(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "ਚੁਣੋ ਮਿਤੀ ...",
		        "buttonLabel": "ਕਲਿੱਕ ਕਰੋ ਜ ਕੁੰਜੀ Enter ਦਬਾਓ ਜ ਸਪੇਸਬਾਰ ਕੈਲੰਡਰ ਨੂੰ ਖੋਲ੍ਹਣ ਲਈ",
		        "prevButtonLabel": "ਪਿਛਲੇ ਮਹੀਨੇ ਜਾਓ",
		        "nextButtonLabel": "ਅਗਲੇ ਮਹੀਨੇ ਜਾਓ",
		        "closeButtonTitle": "ਬੰਦ ਕਰੋ",
		        "closeButtonLabel": "ਕੈਲੰਡਰ ਬੰਦ ਕਰੋ",
		        "prevMonthButtonLabel": "ਪਿਛਲੇ ਸਾਲ ਜਾਓ",
		        "prevYearButtonLabel": "ਪਿਛਲੇ ਵੀਹ ਸਾਲ ਜਾਓ",
		        "nextMonthButtonLabel": "ਅਗਲੇ ਸਾਲ ਜਾਓ",
		        "nextYearButtonLabel": "ਅੱਗੇ ਵੀਹ ਸਾਲ ਜਾਓ",
		        "changeMonthButtonLabel": "ਕਲਿੱਕ ਕਰੋ ਜ ਕੁੰਜੀ Enter ਦਬਾਓ ਜ ਸਪੇਸਬਾਰ ਮਹੀਨੇ ਨੂੰ ਤਬਦੀਲ ਕਰਨ ਲਈ",
		        "changeYearButtonLabel": "ਕਲਿੱਕ ਕਰੋ ਜ ਕੁੰਜੀ Enter ਦਬਾਓ ਜ ਸਪੇਸਬਾਰ ਸਾਲ ਤਬਦੀਲ ਕਰਨ ਲਈ",
		        "changeRangeButtonLabel": "ਕਲਿੱਕ ਕਰੋ ਜ ਅੱਗੇ ਵੀਹ ਸਾਲ ਤੱਕ ਜਾਣ ਲਈ ਕੁੰਜੀ ਜ ਸਪੇਸਬਾਰ Enter ਦਬਾਓ",
		        "calendarHelp": "- ਉੱਪਰ ਤੀਰ ਅਤੇ ਡਾਊਨ ਐਰੋ - ਕ੍ਰਮਵਾਰ ਪਿਛਲੇ ਜ ਨੂੰ ਅਗਲੇ ਹਫਤੇ ਵਿਚ ਹਫ਼ਤੇ ਦੇ ਉਸੇ ਦਿਨ ਨੂੰ ਚਲਾ. ਮਹੀਨੇ ਦੇ ਅੰਤ 'ਤੇ ਪਹੁੰਚ ਗਿਆ ਹੈ, ਜੇ, ਉਚਿਤ ਤੌਰ' ਤੇ ਅੱਗੇ ਜ ਪਿਛਲੇ ਮਹੀਨੇ ਵਿੱਚ ਜਾਰੀ ਹੈ.\r\n- ਖੱਬੇ ਤੀਰ ਅਤੇ ਸੱਜਾ ਤੀਰ - ਵੀ ਇੱਕ ਨਿਰੰਤਰਤਾ ਵਿੱਚ, ਅੱਗੇ ਨੂੰ ਇੱਕ ਦਿਨ ਤਰੱਕੀ. ਅਦਿੱਖ ਫੋਕਸ ਦਿਨ ਚਲੇ ਗਏ ਹਨ ਅਤੇ ਦਿਨ ਦੇ ਗਰਿੱਡ ਵਿੱਚ ਕਤਾਰ ਨੂੰ ਕਤਾਰ ਤੱਕ ਲਪੇਟੇ ਹੈ.\r\n- ਕੰਟਰੋਲ + ਪੰਨਾ ਉੱਪਰ - ਪਿਛਲੇ ਸਾਲ ਵਿੱਚ ਇੱਕੋ ਤਾਰੀਖ ਨੂੰ ਭੇਜਦੀ ਹੈ.\r\n- ਕੰਟਰੋਲ + ਪੰਨਾ Down - ਅਗਲੇ ਸਾਲ ਵਿੱਚ ਇੱਕੋ ਤਾਰੀਖ ਨੂੰ ਭੇਜਦੀ ਹੈ.\r\n- ਘਰ - ਮੌਜੂਦਾ ਮਹੀਨੇ ਦੇ ਪਹਿਲੇ ਦਿਨ ਨੂੰ ਭੇਜਦੀ ਹੈ.\r\n- ਅੰਤ - ਮੌਜੂਦਾ ਮਹੀਨੇ ਦੇ ਆਖਰੀ ਦਿਨ ਤੱਕ ਭੇਜਦੀ ਹੈ.\r\n- ਪੰਨਾ ਉੱਪਰ - ਪਿਛਲੇ ਮਹੀਨੇ ਵਿੱਚ ਵੀ ਇਸੇ ਤਾਰੀਖ ਨੂੰ ਭੇਜਦੀ ਹੈ.\r\n- ਪੰਨਾ Down - ਅਗਲੇ ਮਹੀਨੇ ਵਿੱਚ ਇੱਕੋ ਤਾਰੀਖ ਨੂੰ ਭੇਜਦੀ ਹੈ.\r\n- ਦਿਓ ਜ ਸਪਾਸ - ਕੈਲੰਡਰ ਬੰਦ ਹੈ, ਅਤੇ ਚੁਣੇ ਤਾਰੀਖ ਸੰਬੰਧਿਤ ਪਾਠ ਬਕਸੇ ਵਿੱਚ ਵੇਖਾਇਆ ਗਿਆ ਹੈ.\r\n- ਛੁਡਾਉਣ - ਕਿਸੇ ਵੀ ਕਾਰਵਾਈ ਨੂੰ ਬਿਨਾ ਕੈਲੰਡਰ ਬੰਦ."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "ਜਨਵਰੀ",
		        "ਫ਼ਰਵਰੀ",
		        "ਮਾਰਚ",
		        "ਅਪ੍ਰੈਲ",
		        "ਮਈ",
		        "ਜੂਨ",
		        "ਜੁਲਾਈ",
		        "ਅਗਸਤ",
		        "ਸਤੰਬਰ",
		        "ਅਕਤੂਬਰ",
		        "ਨਵੰਬਰ",
		        "ਦਸੰਬਰ"
		    ],
		    "month_names_abbreviated": [
		        "ਜਨ",
		        "ਫ਼ਰ",
		        "ਮਾਰਚ",
		        "ਅਪ੍ਰੈ",
		        "ਮਈ",
		        "ਜੂਨ",
		        "ਜੁਲਾ",
		        "ਅਗ",
		        "ਸਤੰ",
		        "ਅਕਤੂ",
		        "ਨਵੰ",
		        "ਦਸੰ"
		    ],
		    "month_names_narrow": [
		        "ਜ",
		        "ਫ਼",
		        "ਮਾ",
		        "ਅ",
		        "ਮ",
		        "ਜੂ",
		        "ਜੁ",
		        "ਅ",
		        "ਸ",
		        "ਅ",
		        "ਨ",
		        "ਦ"
		    ],
		    "day_names": [
		        "ਐਤਵਾਰ",
		        "ਸੋਮਵਾਰ",
		        "ਮੰਗਲਵਾਰ",
		        "ਬੁੱਧਵਾਰ",
		        "ਵੀਰਵਾਰ",
		        "ਸ਼ੁੱਕਰਵਾਰ",
		        "ਸ਼ਨਿੱਚਰਵਾਰ"
		    ],
		    "day_names_abbreviated": [
		        "ਐਤ",
		        "ਸੋਮ",
		        "ਮੰਗਲ",
		        "ਬੁੱਧ",
		        "ਵੀਰ",
		        "ਸ਼ੁੱਕਰ",
		        "ਸ਼ਨਿੱਚਰ"
		    ],
		    "day_names_short": [
		        "ਐਤ",
		        "ਸੋਮ",
		        "ਮੰਗ",
		        "ਬੁੱਧ",
		        "ਵੀਰ",
		        "ਸ਼ੁੱਕ",
		        "ਸ਼ਨਿੱ"
		    ],
		    "day_names_narrow": [
		        "ਐ",
		        "ਸੋ",
		        "ਮੰ",
		        "ਬੁੱ",
		        "ਵੀ",
		        "ਸ਼ੁੱ",
		        "ਸ਼"
		    ],
		    "day_periods": {
		        "am": "ਪੂ.ਦੁ.",
		        "noon": "ਦੁਪਹਿਰ",
		        "pm": "ਬਾ.ਦੁ."
		    },
		    "day_periods_abbreviated": {
		        "am": "ਪੂ.ਦੁ.",
		        "noon": "ਦੁਪਹਿਰ",
		        "pm": "ਬਾ.ਦੁ."
		    },
		    "day_periods_narrow": {
		        "am": "ਸ.",
		        "noon": "ਦੁ.",
		        "pm": "ਸ਼."
		    },
		    "quarter_names": [
		        "ਪਹਿਲੀ ਤਿਮਾਹੀ",
		        "ਦੂਜੀ ਤਿਮਾਹੀ",
		        "ਤੀਜੀ ਤਿਮਾਹੀ",
		        "ਚੌਥੀ ਤਿਮਾਹੀ"
		    ],
		    "quarter_names_abbreviated": [
		        "ਤਿਮਾਹੀ1",
		        "ਤਿਮਾਹੀ2",
		        "ਤਿਮਾਹੀ3",
		        "ਤਿਮਾਹੀ4"
		    ],
		    "quarter_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4"
		    ],
		    "era_names": [
		        "ਈਸਵੀ ਪੂਰਵ",
		        "ਈਸਵੀ ਸੰਨ"
		    ],
		    "era_names_abbreviated": [
		        "ਈ. ਪੂ.",
		        "ਸੰਨ"
		    ],
		    "era_names_narrow": [
		        "ਈ. ਪੂ.",
		        "ਸੰਨ"
		    ],
		    "full_format": "EEEE, d MMMM y",
		    "long_format": "d MMMM y",
		    "medium_format": "d MMM y",
		    "short_format": "d/M/yy",
		    "firstday_of_week": 0
		};
	}
})();