(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "தேர்வு தேதி ...",
		        "buttonLabel": "கிளிக் செய்யவும் அல்லது Enter விசையை அழுத்தவும் அல்லது spacebar காலண்டர் திறக்க",
		        "prevButtonLabel": "முந்தைய மாதம் சென்று",
		        "nextButtonLabel": "அடுத்த மாதம் சென்று",
		        "closeButtonTitle": "மூடு",
		        "closeButtonLabel": "காலண்டர் மூடவும்",
		        "prevMonthButtonLabel": "முந்தைய ஆண்டில் சென்று",
		        "prevYearButtonLabel": "முந்தைய இருபது ஆண்டுகளுக்கு சென்று",
		        "nextMonthButtonLabel": "அடுத்த ஆண்டு சென்று",
		        "nextYearButtonLabel": "அடுத்த இருபது ஆண்டுகளில் சென்று",
		        "changeMonthButtonLabel": "கிளிக் செய்யவும் அல்லது Enter விசையை அழுத்தவும் அல்லது spacebar மாதம் மாற்ற",
		        "changeYearButtonLabel": "கிளிக் செய்யவும் அல்லது Enter விசையை அழுத்தவும் அல்லது spacebar ஆண்டு மாற்ற",
		        "changeRangeButtonLabel": "கிளிக் செய்யவும் அல்லது அடுத்த இருபது ஆண்டுகளில் செல்ல முக்கிய அல்லது spacebar Enter ஐ அழுத்தவும்",
		        "calendarHelp": "- அம்பு மற்றும் அம்பு - முறையே முந்தைய அல்லது அடுத்த வாரம் வாரம் அதே நாள் செல்கிறது. மாத இறுதியில் அடைந்தது, பொருத்தமான அடுத்த அல்லது முந்தைய மாதம் தொடர்கிறது.\r\n- இடது அம்பு மற்றும் வலது அம்பு - மேலும் ஒரு தொடர்ச்சி, அடுத்த ஒரு நாள் முன்னெடுக்கிறது. பார்வை கவனம் நாளுக்குநாள் சென்றார் மற்றும் நாட்கள் கட்டம் வரிசை வரிசையில் இருந்து மறைப்புகள்.\r\n- கண்ட்ரோல் + பக்கம் அப் - முந்தைய ஆண்டில் அதே தேதியில் நகரும்.\r\n- கண்ட்ரோல் + டவுன் பக்கம் - அடுத்த ஆண்டு அதே தேதி நகர்வுகள்.\r\n- முகப்பு - தற்போதைய மாதம் முதல் நாள் நகரும்.\r\n- முடிவு - நடப்பு மாதம் கடைசி நாள் நகர்வுகள்.\r\n- பக்கம் அப் - முந்தைய மாதத்தில் அதே தேதியில் நகரும்.\r\n- டவுன் பக்கம் - அடுத்த மாதம் அதே தேதியில் நகரும்.\r\n- உள்ளிடவும் அல்லது ஈஸ்பேஸ் - காலண்டர் மூடி, மற்றும் தேர்வு தேதி தொடர்புடைய உரை பெட்டியில் காட்டப்பட்டுள்ளது.\r\n- எஸ்கேப் - எந்த நடவடிக்கையும் இல்லாமல் காலண்டர் நிறைவடைகிறது."
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "ஜனவரி",
		        "பிப்ரவரி",
		        "மார்ச்",
		        "ஏப்ரல்",
		        "மே",
		        "ஜூன்",
		        "ஜூலை",
		        "ஆகஸ்ட்",
		        "செப்டம்பர்",
		        "அக்டோபர்",
		        "நவம்பர்",
		        "டிசம்பர்"
		    ],
		    "month_names_abbreviated": [
		        "ஜன.",
		        "பிப்.",
		        "மார்.",
		        "ஏப்.",
		        "மே",
		        "ஜூன்",
		        "ஜூலை",
		        "ஆக.",
		        "செப்.",
		        "அக்.",
		        "நவ.",
		        "டிச."
		    ],
		    "month_names_narrow": [
		        "ஜ",
		        "பி",
		        "மா",
		        "ஏ",
		        "மே",
		        "ஜூ",
		        "ஜூ",
		        "ஆ",
		        "செ",
		        "அ",
		        "ந",
		        "டி"
		    ],
		    "day_names": [
		        "ஞாயிறு",
		        "திங்கள்",
		        "செவ்வாய்",
		        "புதன்",
		        "வியாழன்",
		        "வெள்ளி",
		        "சனி"
		    ],
		    "day_names_abbreviated": [
		        "ஞா",
		        "தி",
		        "செ",
		        "பு",
		        "வி",
		        "வெ",
		        "ச"
		    ],
		    "day_names_short": [
		        "ஞா",
		        "தி",
		        "செ",
		        "பு",
		        "வி",
		        "வெ",
		        "ச"
		    ],
		    "day_names_narrow": [
		        "ஞா",
		        "தி",
		        "செ",
		        "பு",
		        "வி",
		        "வெ",
		        "ச"
		    ],
		    "day_periods": {
		        "am": "முற்பகல்",
		        "noon": "நண்பகல்",
		        "pm": "பிற்பகல்"
		    },
		    "day_periods_abbreviated": {
		        "am": "முற்பகல்",
		        "noon": "நண்பகல்",
		        "pm": "பிற்பகல்"
		    },
		    "day_periods_narrow": {
		        "am": "மு.ப",
		        "noon": "ம",
		        "pm": "பி.ப"
		    },
		    "quarter_names": [
		        "முதல் காலாண்டு",
		        "இரண்டாம் காலாண்டு",
		        "மூன்றாம் காலாண்டு",
		        "நான்காம் காலாண்டு"
		    ],
		    "quarter_names_abbreviated": [
		        "காலாண்டு1",
		        "காலாண்டு2",
		        "காலாண்டு3",
		        "காலாண்டு4"
		    ],
		    "quarter_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4"
		    ],
		    "era_names": [
		        "கிறிஸ்துவுக்கு முன்",
		        "அனோ டோமினி"
		    ],
		    "era_names_abbreviated": [
		        "கி.மு.",
		        "கி.பி."
		    ],
		    "era_names_narrow": [
		        "கி.மு.",
		        "கி.பி."
		    ],
		    "full_format": "EEEE, d MMMM, y",
		    "long_format": "d MMMM, y",
		    "medium_format": "d MMM, y",
		    "short_format": "d-M-yy",
		    "firstday_of_week": 1
		};
	}
})();