(function () {
	"use strict";

	if (typeof Date.dp_locales === 'undefined') {
		Date.dp_locales = {
		    "texts": {
		        "buttonTitle": "เลือกวันที่ ...",
		        "buttonLabel": "คลิกหรือกดปุ่ม Enter หรือสเปซบาร์เพื่อเปิดปฏิทิน",
		        "prevButtonLabel": "ไปที่เดือนก่อนหน้า",
		        "nextButtonLabel": "ไปที่เดือนถัดไป",
		        "closeButtonTitle": "ปิด",
		        "closeButtonLabel": "ปิดปฏิทิน",
		        "prevMonthButtonLabel": "ไปเมื่อปีที่แล้ว",
		        "prevYearButtonLabel": "ไปยี่สิบปีที่ผ่านมา",
		        "nextMonthButtonLabel": "ไปในปีถัดไป",
		        "nextYearButtonLabel": "ไปอีกยี่สิบปี",
		        "changeMonthButtonLabel": "คลิกหรือกดปุ่ม Enter หรือ spacebar เพื่อเปลี่ยนเดือน",
		        "changeYearButtonLabel": "คลิกหรือกดปุ่ม Enter หรือสเปซบาร์เพื่อเปลี่ยนปี",
		        "changeRangeButtonLabel": "คลิกหรือกดปุ่ม Enter หรือสเปซบาร์เพื่อไปอีกยี่สิบปี",
		        "calendarHelp": "- ลูกศรขึ้นและลงลูกศร - ไปในวันเดียวกันของสัปดาห์ในสัปดาห์ก่อนหน้าหรือถัดไปตามลำดับ ถ้าสิ้นเดือนถึงยังคงเข้ามาในเดือนถัดไปหรือก่อนหน้าตามความเหมาะสม\r\n- ลูกศรซ้ายและลูกศรขวา - วันหนึ่งความก้าวหน้าต่อไปยังอยู่ในความต่อเนื่อง โฟกัสสายตาจะถูกย้ายไปวัน ๆ และตัดจากแถวแถวในตารางของวัน\r\n- การควบคุม + หน้าขึ้น - เลื่อนวันเดียวกันของปีก่อน\r\n- การควบคุม + หน้าลง - เลื่อนวันเดียวกันในปีถัดไป\r\n- บ้าน - ย้ายไปในวันแรกของเดือนปัจจุบัน\r\n- สิ้นสุด - เลื่อนไปในวันสุดท้ายของเดือนปัจจุบัน\r\n- หน้าขึ้น - เลื่อนวันเดียวกันในเดือนก่อนหน้า\r\n- หน้าลง - ย้ายไปยังวันเดียวกันในเดือนถัดไป\r\n- Enter หรือ Espace - ปิดปฏิทินและวันที่ที่เลือกจะปรากฏในกล่องข้อความที่เกี่ยวข้อง\r\n- หนี - ปิดปฏิทินโดยไม่ต้องดำเนินการใด ๆ"
		    },
		    "directionality": "LTR",
		    "month_names": [
		        "มกราคม",
		        "กุมภาพันธ์",
		        "มีนาคม",
		        "เมษายน",
		        "พฤษภาคม",
		        "มิถุนายน",
		        "กรกฎาคม",
		        "สิงหาคม",
		        "กันยายน",
		        "ตุลาคม",
		        "พฤศจิกายน",
		        "ธันวาคม"
		    ],
		    "month_names_abbreviated": [
		        "ม.ค.",
		        "ก.พ.",
		        "มี.ค.",
		        "เม.ย.",
		        "พ.ค.",
		        "มิ.ย.",
		        "ก.ค.",
		        "ส.ค.",
		        "ก.ย.",
		        "ต.ค.",
		        "พ.ย.",
		        "ธ.ค."
		    ],
		    "month_names_narrow": [
		        "ม.ค.",
		        "ก.พ.",
		        "มี.ค.",
		        "เม.ย.",
		        "พ.ค.",
		        "มิ.ย.",
		        "ก.ค.",
		        "ส.ค.",
		        "ก.ย.",
		        "ต.ค.",
		        "พ.ย.",
		        "ธ.ค."
		    ],
		    "day_names": [
		        "วันอาทิตย์",
		        "วันจันทร์",
		        "วันอังคาร",
		        "วันพุธ",
		        "วันพฤหัสบดี",
		        "วันศุกร์",
		        "วันเสาร์"
		    ],
		    "day_names_abbreviated": [
		        "อา.",
		        "จ.",
		        "อ.",
		        "พ.",
		        "พฤ.",
		        "ศ.",
		        "ส."
		    ],
		    "day_names_short": [
		        "อา.",
		        "จ.",
		        "อ.",
		        "พ.",
		        "พฤ.",
		        "ศ.",
		        "ส."
		    ],
		    "day_names_narrow": [
		        "อา",
		        "จ",
		        "อ",
		        "พ",
		        "พฤ",
		        "ศ",
		        "ส"
		    ],
		    "day_periods": {
		        "am": "ก่อนเที่ยง",
		        "noon": "เที่ยง",
		        "pm": "หลังเที่ยง"
		    },
		    "day_periods_abbreviated": {
		        "am": "ก่อนเที่ยง",
		        "noon": "เที่ยง",
		        "pm": "หลังเที่ยง"
		    },
		    "day_periods_narrow": {
		        "am": "a",
		        "noon": "n",
		        "pm": "p"
		    },
		    "quarter_names": [
		        "ไตรมาส 1",
		        "ไตรมาส 2",
		        "ไตรมาส 3",
		        "ไตรมาส 4"
		    ],
		    "quarter_names_abbreviated": [
		        "ไตรมาส 1",
		        "ไตรมาส 2",
		        "ไตรมาส 3",
		        "ไตรมาส 4"
		    ],
		    "quarter_names_narrow": [
		        "1",
		        "2",
		        "3",
		        "4"
		    ],
		    "era_names": [
		        "ปีก่อนคริสต์ศักราช",
		        "คริสต์ศักราช"
		    ],
		    "era_names_abbreviated": [
		        "ปีก่อน ค.ศ.",
		        "ค.ศ."
		    ],
		    "era_names_narrow": [
		        "ก่อน ค.ศ.",
		        "ค.ศ."
		    ],
		    "full_format": "EEEEที่ d MMMM G y",
		    "long_format": "d MMMM G y",
		    "medium_format": "d MMM y",
		    "short_format": "d/M/yy",
		    "firstday_of_week": 0
		};
	}
})();